Revit 2027 API
CurveArrArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveArrArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As CurveArrArrayIterator
public:
virtual CurveArrArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> CurveArrArrayIterator
override ReverseIterator : unit -> CurveArrArrayIterator
Return Value
CurveArrArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
CurveArrArray Class
Autodesk.Revit.DB Namespace